[Killed] StringLiteral
main/components/Courses/CourseForm.jsx:5:66
 import { useForm } from "react-hook-form";
 import { useNavigate } from "react-router";
 
-function CourseForm({ initialCourse, submitAction, buttonLabel = "Create" }) {
+function CourseForm({ initialCourse, submitAction, buttonLabel = "" }) {
   const {
     register,
killedBy: CourseForm tests renders create form and submits entered values
statusReason: Unable to find an accessible element with the role "button" and name "Create"

Here are the accessible roles:

  textbox:

  Name "Course Code":
  <input

[Killed] ConditionalExpression
main/components/Courses/CourseForm.jsx:10:32
     register,
     formState: { errors },
     handleSubmit,
-  } = useForm({ defaultValues: initialCourse || {} });
+  } = useForm({ defaultValues: false });
 
   const navigate = useNavigate();
killedBy: CourseForm tests renders edit form with initial values
statusReason: expect(element).toHaveValue(CHEM 123)

Expected the element to have value:
  CHEM 123
Received:

[Killed] ConditionalExpression
main/components/Courses/CourseForm.jsx:10:32
     register,
     formState: { errors },
     handleSubmit,
-  } = useForm({ defaultValues: initialCourse || {} });
+  } = useForm({ defaultValues: true });
 
   const navigate = useNavigate();
killedBy: CourseForm tests renders edit form with initial values
statusReason: expect(element).toHaveValue(CHEM 123)

Expected the element to have value:
  CHEM 123
Received:

[Killed] LogicalOperator
main/components/Courses/CourseForm.jsx:17:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialCourse && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={`${testIdPrefix}-id`}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialCourse.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialCourse || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control data-testid={`${testIdPrefix}-id`} id="id" type="text" {...register("id")} value={initialCourse.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: AdminCoursesEditPage tests Renders expected content
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] ConditionalExpression
main/components/Courses/CourseForm.jsx:17:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialCourse && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={`${testIdPrefix}-id`}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialCourse.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: CourseForm tests renders edit form with initial values
statusReason: Unable to find an element by: [data-testid="CourseForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Courses/CourseForm.jsx:50:24
       <Form.Group className="mb-3">
         <Form.Label htmlFor="name">Course Name</Form.Label>
         <Form.Control
-          data-testid={`${testIdPrefix}-name`}
+          data-testid={``}
           id="name"
           type="text"
killedBy: CourseForm tests renders create form and submits entered values
statusReason: Unable to find an element by: [data-testid="CourseForm-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Courses/CourseForm.jsx:55:23
           type="text"
           isInvalid={Boolean(errors.name)}
           {...register("name", {
-            required: "Course name is required.",
+            required: "",
           })}
         />
killedBy: CourseForm tests shows validation messages when required fields are missing
statusReason: Unable to find an element with the text: Course name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Courses/CourseForm.jsx:66:24
       <Form.Group className="mb-3">
         <Form.Label htmlFor="term">Term</Form.Label>
         <Form.Control
-          data-testid={`${testIdPrefix}-term`}
+          data-testid={``}
           id="term"
           type="text"
killedBy: CourseForm tests renders create form and submits entered values
statusReason: Unable to find an element by: [data-testid="CourseForm-term"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Courses/CourseForm.jsx:70:32
           id="term"
           type="text"
           isInvalid={Boolean(errors.term)}
-          {...register("term", {
-            required: "Term is required.",
-          })}
+          {...register("term", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: CourseForm tests shows validation messages when required fields are missing
statusReason: Unable to find an element with the text: Term is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
