[Killed] ArrowFunction
src/main/pages/AdminCoursesCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function AdminCoursesCreatePage() {
-  const objectToAxiosParams = (newCourse) => ({
-    url: "/api/course",
-    method: "POST",
-    data: newCourse,
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: AdminCoursesCreatePage tests submits a new course and redirects
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminCoursesCreatePage.jsx:10:13
 export default function AdminCoursesCreatePage() {
   const objectToAxiosParams = (newCourse) => ({
     url: "/api/course",
-    method: "POST",
+    method: "",
     data: newCourse,
   });
killedBy: AdminCoursesCreatePage tests submits a new course and redirects
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminCoursesCreatePage.jsx:14:33
     data: newCourse,
   });
 
-  const onSuccess = (course) => {
-    toast(`Course created - id: ${course.id} code: ${course.code}`);
-  };
+  const onSuccess = (course) => {};
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
killedBy: AdminCoursesCreatePage tests submits a new course and redirects
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
src/main/pages/AdminCoursesCreatePage.jsx:19:5
   };
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
-    "/api/course/all",
+    "",
   ]);
 
killedBy: AdminCoursesCreatePage config tests configures mutation hook with expected cache key and request builder
statusReason: expected [ '' ] to deeply equal [ '/api/course/all' ]

[Killed] BlockStatement
src/main/pages/AdminCoursesCreatePage.jsx:26:27
     mutation.mutate(data);
   };
 
-  if (mutation.isSuccess) {
-    return <Navigate to="/admin/listcourses" />;
-  }
+  if (mutation.isSuccess) {}
 
   return (
killedBy: AdminCoursesCreatePage tests submits a new course and redirects
statusReason: expected "spy" to be called with arguments: [ { to: '/admin/listcourses' } ]

Number of calls: 0
