[Killed] StringLiteral
src/main/pages/AdminCoursesEditPage.jsx:10:40
 export default function AdminCoursesEditPage() {
   const { id } = useParams();
 
-  const { data: course } = useBackend([`/api/course/${id}`], {
+  const { data: course } = useBackend([``], {
     method: "GET",
     url: `/api/course/${id}`,
killedBy: AdminCoursesEditPage config tests configures backend hooks with expected query keys and request builder
statusReason: expected "spy" to be called with arguments: [ [ '/api/course/7' ], …(1) ]

Received: 

  1st spy call:

@@ -1,8 +1,8 @@
  [

[Killed] ObjectLiteral
src/main/pages/AdminCoursesEditPage.jsx:10:62
 export default function AdminCoursesEditPage() {
   const { id } = useParams();
 
-  const { data: course } = useBackend([`/api/course/${id}`], {
-    method: "GET",
-    url: `/api/course/${id}`,
-  });
+  const { data: course } = useBackend([`/api/course/${id}`], {});
 
   const objectToAxiosParams = (updatedCourse) => ({
killedBy: AdminCoursesEditPage tests Renders expected content
statusReason: Unable to find a label with the text of: Course Code

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
src/main/pages/AdminCoursesEditPage.jsx:15:31
     url: `/api/course/${id}`,
   });
 
-  const objectToAxiosParams = (updatedCourse) => ({
-    url: `/api/course/${updatedCourse.id}`,
-    method: "PUT",
-    data: {
-      code: updatedCourse.code,
-      name: updatedCourse.name,
-      term: updatedCourse.term,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (_, updatedCourse) => {
killedBy: AdminCoursesEditPage config tests configures backend hooks with expected query keys and request builder
statusReason: expected undefined to deeply equal { url: '/api/course/7', …(2) }

[Killed] ObjectLiteral
src/main/pages/AdminCoursesEditPage.jsx:18:11
   const objectToAxiosParams = (updatedCourse) => ({
     url: `/api/course/${updatedCourse.id}`,
     method: "PUT",
-    data: {
-      code: updatedCourse.code,
-      name: updatedCourse.name,
-      term: updatedCourse.term,
-    },
+    data: {},
   });
 
killedBy: AdminCoursesEditPage config tests configures backend hooks with expected query keys and request builder
statusReason: expected { url: '/api/course/7', …(2) } to deeply equal { url: '/api/course/7', …(2) }

[Killed] BlockStatement
src/main/pages/AdminCoursesEditPage.jsx:25:43
     },
   });
 
-  const onSuccess = (_, updatedCourse) => {
-    toast(
-      `Course updated - id: ${updatedCourse.id} code: ${updatedCourse.code}`,
-    );
-  };
+  const onSuccess = (_, updatedCourse) => {};
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
killedBy: AdminCoursesEditPage tests submits updated course and redirects
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ArrayDeclaration
src/main/pages/AdminCoursesEditPage.jsx:31:75
     );
   };
 
-  const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
-    `/api/course/${id}`,
-  ]);
+  const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, []);
 
   const submitAction = async (data) => {
killedBy: AdminCoursesEditPage config tests configures backend hooks with expected query keys and request builder
statusReason: expected [] to deeply equal [ '/api/course/7' ]

[Killed] ConditionalExpression
src/main/pages/AdminCoursesEditPage.jsx:47:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Course</h1>
-        {course && (
-          <CourseForm
-            initialCourse={course}
-            submitAction={submitAction}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: AdminCoursesEditPage tests Renders expected content
statusReason: Unable to find a label with the text of: Course Code

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/AdminCoursesEditPage.jsx:47:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Course</h1>
-        {course && (
-          <CourseForm
-            initialCourse={course}
-            submitAction={submitAction}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: AdminCoursesEditPage tests Renders expected content
statusReason: Unable to find a label with the text of: Course Code

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
