[Killed] LogicalOperator
src/main/pages/AdminAnnouncementsPage.jsx:40:25
   // Stryker restore all
 
   const commonsName = commonsPlus?.commons.name;
-  const announcements = announcementsPage?.content ?? [];
+  const announcements = announcementsPage?.content && [];
 
   return (
killedBy: AdminAnnouncementsPage tests renders announcements with correct commons name
statusReason: Unable to find an element by: [data-testid="AnnouncementTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] OptionalChaining
src/main/pages/AdminAnnouncementsPage.jsx:40:25
   // Stryker restore all
 
   const commonsName = commonsPlus?.commons.name;
-  const announcements = announcementsPage?.content ?? [];
+  const announcements = announcementsPage.content ?? [];
 
   return (
