[Killed] ConditionalExpression
main/components/Commons/AdminCommonsCard.jsx:176:21
               <div>
                 <strong>Total Cows:</strong>
               </div>
-              <div>{commonItem.totalCows || 0}</div>
+              <div>{false}</div>
             </Col>
             <Col xs={12} sm={6} md={3} className="mb-3">
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  10
Received:

[Killed] ConditionalExpression
main/components/Commons/AdminCommonsCard.jsx:194:21
               <div>
                 <strong>Eff Cap:</strong>
               </div>
-              <div>{commonItem.effectiveCapacity || 0}</div>
+              <div>{true}</div>
             </Col>
           </Row>
killedBy: AdminCommonsCard tests displays all commons fields correctly
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  100
Received:

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:219:28
               variant="secondary"
               size="sm"
               onClick={handleLeaderboard}
-              data-testid={`AdminCommonsCard-Leaderboard-${commons.id}`}
+              data-testid={``}
             >
               Leaderboard
killedBy: AdminCommonsCard tests leaderboard button navigates to leaderboard page
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-Leaderboard-1"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:235:28
               variant="info"
               size="sm"
               href={`/admin/announcements/${commons.id}`}
-              data-testid={`AdminCommonsCard-Announcements-${commons.id}`}
+              data-testid={``}
             >
               Announcements
killedBy: AdminCommonsCard tests announcements button has correct href
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-Announcements-1"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:243:28
               variant="secondary"
               size="sm"
               href={`/admin/chat/${commons.id}`}
-              data-testid={`AdminCommonsCard-Chat-${commons.id}`}
+              data-testid={``}
             >
               Chat
killedBy: AdminCommonsCard tests chat button has correct href
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-Chat-1"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
