[Killed] BlockStatement
src/main/pages/AdminDashboardPage.jsx:3:46
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function AdminDashboardPage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Admin Dashboard!</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function AdminDashboardPage() {}
 
killedBy: PlaceholderDashboardPage tests Renders expected content
statusReason: Unable to find an element with the text: Admin Dashboard!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
