[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:30:41
   ]);
   // Stryker restore all
 
-  const submitTestJob = async (data) => {
-    toast("Submitted job: Test Job");
-    testJobMutation.mutate(data);
-  };
+  const submitTestJob = async (data) => {};
 
   // *** Record Common Stats job ***
killedBy: AdminJobsPage tests user can submit a test job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.jsx:37:51
 
   // *** Record Common Stats job ***
 
-  const objectToAxiosParamsRecordCommonStatsJob = () => ({
-    url: `/api/jobs/launch/recordcommonstats`,
-    method: "POST",
-  });
+  const objectToAxiosParamsRecordCommonStatsJob = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit record common stats job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:38:10
   // *** Record Common Stats job ***
 
   const objectToAxiosParamsRecordCommonStatsJob = () => ({
-    url: `/api/jobs/launch/recordcommonstats`,
+    url: ``,
     method: "POST",
   });
killedBy: AdminJobsPage tests user can submit record common stats job
statusReason: expected '' to be '/api/jobs/launch/recordcommonstats' // Object.is equality

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:39:13
 
   const objectToAxiosParamsRecordCommonStatsJob = () => ({
     url: `/api/jobs/launch/recordcommonstats`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit record common stats job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:50:50
   );
   // Stryker restore all
 
-  const submitRecordCommonStatsJob = async () => {
-    toast("Submitted Job: Record Common Stats");
-    RecordCommonStatsMutation.mutate();
-  };
+  const submitRecordCommonStatsJob = async () => {};
 
   // *** SetCowHealth job ***
killedBy: AdminJobsPage tests user can submit record common stats job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.jsx:57:46
 
   // *** SetCowHealth job ***
 
-  const objectToAxiosParamsSetCowHealthJob = (data) => ({
-    url: `/api/jobs/launch/setcowhealth?commonsID=${data.selectedCommons}&health=${data.healthValue}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsSetCowHealthJob = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:58:10
   // *** SetCowHealth job ***
 
   const objectToAxiosParamsSetCowHealthJob = (data) => ({
-    url: `/api/jobs/launch/setcowhealth?commonsID=${data.selectedCommons}&health=${data.healthValue}`,
+    url: ``,
     method: "POST",
   });
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: expected '' to be '/api/jobs/launch/setcowhealth?commons…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:70:49
   );
   // Stryker restore all
 
-  const submitSetCowHealthJob = async (data) => {
-    toast(
-      `Submitted Job: Set Cow Health (Commons: ${data.selectedCommonsName}, Health: ${data.healthValue})`,
-    );
-    SetCowHealthMutation.mutate(data);
-  };
+  const submitSetCowHealthJob = async (data) => {};
 
   // *** UpdateCowHealth job ***
killedBy: AdminJobsPage tests user can submit a set cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.jsx:79:49
 
   // *** UpdateCowHealth job ***
 
-  const objectToAxiosParamsUpdateCowHealthJob = () => ({
-    url: `/api/jobs/launch/updatecowhealth`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCowHealthJob = () => undefined;
 
   const objectToAxiosParamsUpdateCowHealthJobSingle = (data) => ({
killedBy: AdminJobsPage tests user can submit update cow health job for all commons
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.jsx:84:55
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateCowHealthJobSingle = (data) => ({
-    url: `/api/jobs/launch/updatecowhealthsinglecommons?commonsId=${data.selectedCommons}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCowHealthJobSingle = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:86:13
 
   const objectToAxiosParamsUpdateCowHealthJobSingle = (data) => ({
     url: `/api/jobs/launch/updatecowhealthsinglecommons?commonsId=${data.selectedCommons}`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:103:52
   );
   // Stryker restore all
 
-  const submitUpdateCowHealthJob = async (data) => {
-    if (data.selectedCommonsName === "All Commons") {
-      toast("Submitted Job: Update Cow Health");
-      UpdateCowHealthMutation.mutate();
-    } else {
-      toast(
-        `Submitted Job: Update Cow Health (Commons: ${data.selectedCommonsName})`,
-      );
-      UpdateCowHealthSingleMutation.mutate(data);
-    }
-  };
+  const submitUpdateCowHealthJob = async (data) => {};
 
   // *** MilkTheCows job ***
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/main/pages/AdminJobsPage.jsx:104:9
   // Stryker restore all
 
   const submitUpdateCowHealthJob = async (data) => {
-    if (data.selectedCommonsName === "All Commons") {
+    if (true) {
       toast("Submitted Job: Update Cow Health");
       UpdateCowHealthMutation.mutate();
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: expected '/api/jobs/launch/updatecowhealth' to be '/api/jobs/launch/updatecowhealthsingl…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:104:53
   // Stryker restore all
 
   const submitUpdateCowHealthJob = async (data) => {
-    if (data.selectedCommonsName === "All Commons") {
-      toast("Submitted Job: Update Cow Health");
-      UpdateCowHealthMutation.mutate();
-    } else {
+    if (data.selectedCommonsName === "All Commons") {} else {
       toast(
         `Submitted Job: Update Cow Health (Commons: ${data.selectedCommonsName})`,
killedBy: AdminJobsPage tests user can submit update cow health job for all commons
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:107:12
     if (data.selectedCommonsName === "All Commons") {
       toast("Submitted Job: Update Cow Health");
       UpdateCowHealthMutation.mutate();
-    } else {
-      toast(
-        `Submitted Job: Update Cow Health (Commons: ${data.selectedCommonsName})`,
-      );
-      UpdateCowHealthSingleMutation.mutate(data);
-    }
+    } else {}
   };
 
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:109:9
       UpdateCowHealthMutation.mutate();
     } else {
       toast(
-        `Submitted Job: Update Cow Health (Commons: ${data.selectedCommonsName})`,
+        ``,
       );
       UpdateCowHealthSingleMutation.mutate(data);
killedBy: AdminJobsPage tests user can submit update cow health job
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Submitted Job: Update Cow Health (Commons: Anika's Commons)",

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.jsx:117:45
 
   // *** MilkTheCows job ***
 
-  const objectToAxiosParamsMilkTheCowsJob = () => ({
-    url: `/api/jobs/launch/milkthecowjob`,
-    method: "POST",
-  });
+  const objectToAxiosParamsMilkTheCowsJob = () => undefined;
 
   const objectToAxiosParamsMilkTheCowsJobSingle = (data) => ({
killedBy: AdminJobsPage tests user can submit milk the cows job for all commons
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:119:13
 
   const objectToAxiosParamsMilkTheCowsJob = () => ({
     url: `/api/jobs/launch/milkthecowjob`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit milk the cows job for all commons
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.jsx:122:51
     method: "POST",
   });
 
-  const objectToAxiosParamsMilkTheCowsJobSingle = (data) => ({
-    url: `/api/jobs/launch/milkthecowjobsinglecommons?commonsId=${data.selectedCommons}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsMilkTheCowsJobSingle = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:123:10
   });
 
   const objectToAxiosParamsMilkTheCowsJobSingle = (data) => ({
-    url: `/api/jobs/launch/milkthecowjobsinglecommons?commonsId=${data.selectedCommons}`,
+    url: ``,
     method: "POST",
   });
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: expected '' to be '/api/jobs/launch/milkthecowjobsinglec…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:141:48
   );
   // Stryker restore all
 
-  const submitMilkTheCowsJob = async (data) => {
-    if (data.selectedCommonsName === "All Commons") {
-      toast("Submitted Job: Milk The Cows!");
-      MilkTheCowsMutation.mutate();
-    } else {
-      toast(
-        `Submitted Job: Milk The Cows! (Commons: ${data.selectedCommonsName})`,
-      );
-      MilkTheCowsSingleMutation.mutate(data);
-    }
-  };
+  const submitMilkTheCowsJob = async (data) => {};
   // *** Instructor Report job ***
 
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:142:53
   // Stryker restore all
 
   const submitMilkTheCowsJob = async (data) => {
-    if (data.selectedCommonsName === "All Commons") {
-      toast("Submitted Job: Milk The Cows!");
-      MilkTheCowsMutation.mutate();
-    } else {
+    if (data.selectedCommonsName === "All Commons") {} else {
       toast(
         `Submitted Job: Milk The Cows! (Commons: ${data.selectedCommonsName})`,
killedBy: AdminJobsPage tests user can submit milk the cows job for all commons
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
src/main/pages/AdminJobsPage.jsx:142:9
   // Stryker restore all
 
   const submitMilkTheCowsJob = async (data) => {
-    if (data.selectedCommonsName === "All Commons") {
+    if (true) {
       toast("Submitted Job: Milk The Cows!");
       MilkTheCowsMutation.mutate();
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: expected '/api/jobs/launch/milkthecowjob' to be '/api/jobs/launch/milkthecowjobsinglec…' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:143:13
 
   const submitMilkTheCowsJob = async (data) => {
     if (data.selectedCommonsName === "All Commons") {
-      toast("Submitted Job: Milk The Cows!");
+      toast("");
       MilkTheCowsMutation.mutate();
     } else {
killedBy: AdminJobsPage tests user can submit milk the cows job for all commons
statusReason: expected "spy" to be called with arguments: [ 'Submitted Job: Milk The Cows!' ]

Received: 

  1st spy call:

  [
-   "Submitted Job: Milk The Cows!",

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:145:12
     if (data.selectedCommonsName === "All Commons") {
       toast("Submitted Job: Milk The Cows!");
       MilkTheCowsMutation.mutate();
-    } else {
-      toast(
-        `Submitted Job: Milk The Cows! (Commons: ${data.selectedCommonsName})`,
-      );
-      MilkTheCowsSingleMutation.mutate(data);
-    }
+    } else {}
   };
   // *** Instructor Report job ***
killedBy: AdminJobsPage tests user can submit milk the cows job
statusReason: Cannot read properties of undefined (reading 'url')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.jsx:154:50
   };
   // *** Instructor Report job ***
 
-  const objectToAxiosParamsInstructorReportJob = () => ({
-    url: `/api/jobs/launch/instructorreport`,
-    method: "POST",
-  });
+  const objectToAxiosParamsInstructorReportJob = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit instructor report job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:154:57
   };
   // *** Instructor Report job ***
 
-  const objectToAxiosParamsInstructorReportJob = () => ({
-    url: `/api/jobs/launch/instructorreport`,
-    method: "POST",
-  });
+  const objectToAxiosParamsInstructorReportJob = () => ({});
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit instructor report job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:167:49
   );
   // Stryker restore all
 
-  const submitInstructorReportJob = async () => {
-    toast("Submitted Job: Instructor Report");
-    InstructorReportMutation.mutate();
-  };
+  const submitInstructorReportJob = async () => {};
 
   // *** Instructor Report (Specific Commons) job ***
killedBy: AdminJobsPage tests user can submit instructor report job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:168:11
   // Stryker restore all
 
   const submitInstructorReportJob = async () => {
-    toast("Submitted Job: Instructor Report");
+    toast("");
     InstructorReportMutation.mutate();
   };
killedBy: AdminJobsPage tests user can submit instructor report job
statusReason: expected "spy" to be called with arguments: [ 'Submitted Job: Instructor Report' ]

Received: 

  1st spy call:

  [
-   "Submitted Job: Instructor Report",

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:174:75
 
   // *** Instructor Report (Specific Commons) job ***
 
-  const objectToAxiosParamsInstructorReportSpecificCommonsJob = (data) => {
-    return {
-      url: `/api/jobs/launch/instructorreportsinglecommons?commonsId=${data.selectedCommons}`,
-      method: "POST",
-    };
-  };
+  const objectToAxiosParamsInstructorReportSpecificCommonsJob = (data) => {};
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit instructor report (specific commons) job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:175:12
   // *** Instructor Report (Specific Commons) job ***
 
   const objectToAxiosParamsInstructorReportSpecificCommonsJob = (data) => {
-    return {
-      url: `/api/jobs/launch/instructorreportsinglecommons?commonsId=${data.selectedCommons}`,
-      method: "POST",
-    };
+    return {};
   };
 
killedBy: AdminJobsPage tests user can submit instructor report (specific commons) job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/AdminJobsPage.jsx:189:68
   );
   // Stryker restore all
 
-  const submitInstructorReportSpecificCommonsJob = async (data) => {
-    toast("Submitted Job: Instructor Report (Specific Commons)");
-    InstructorReportSpecificCommonsMutation.mutate(data);
-  };
+  const submitInstructorReportSpecificCommonsJob = async (data) => {};
 
   const jobLaunchers = [
killedBy: AdminJobsPage tests user can submit instructor report (specific commons) job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:190:11
   // Stryker restore all
 
   const submitInstructorReportSpecificCommonsJob = async (data) => {
-    toast("Submitted Job: Instructor Report (Specific Commons)");
+    toast("");
     InstructorReportSpecificCommonsMutation.mutate(data);
   };
killedBy: AdminJobsPage tests user can submit instructor report (specific commons) job
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Submitted Job: Instructor Report (Specific Commons)",

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:200:13
       form: <TestJobForm submitAction={submitTestJob} />,
     },
     {
-      name: "Record Common Stats",
+      name: "",
       form: <RecordCommonStatsForm submitAction={submitRecordCommonStatsJob} />,
     },
killedBy: AdminJobsPage tests renders without crashing
statusReason: Unable to find an element with the text: Record Common Stats. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:203:5
       name: "Record Common Stats",
       form: <RecordCommonStatsForm submitAction={submitRecordCommonStatsJob} />,
     },
-    {
-      name: "Set Cow Health for a Specific Commons",
-      form: <SetCowHealthForm submitAction={submitSetCowHealthJob} />,
-    },
+    {},
     {
       name: "Update Cow Health",
killedBy: AdminJobsPage tests renders without crashing
statusReason: Unable to find an element with the text: Set Cow Health for a Specific Commons. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:204:13
       form: <RecordCommonStatsForm submitAction={submitRecordCommonStatsJob} />,
     },
     {
-      name: "Set Cow Health for a Specific Commons",
+      name: "",
       form: <SetCowHealthForm submitAction={submitSetCowHealthJob} />,
     },
killedBy: AdminJobsPage tests renders without crashing
statusReason: Unable to find an element with the text: Set Cow Health for a Specific Commons. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.jsx:207:5
       name: "Set Cow Health for a Specific Commons",
       form: <SetCowHealthForm submitAction={submitSetCowHealthJob} />,
     },
-    {
-      name: "Update Cow Health",
-      form: <UpdateCowHealthForm submitAction={submitUpdateCowHealthJob} />,
-    },
+    {},
     {
       name: "Milk The Cows",
killedBy: AdminJobsPage tests renders without crashing
statusReason: Unable to find an element with the text: Update Cow Health. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:212:13
       form: <UpdateCowHealthForm submitAction={submitUpdateCowHealthJob} />,
     },
     {
-      name: "Milk The Cows",
+      name: "",
       form: <MilkCowsJobForm submitAction={submitMilkTheCowsJob} />,
     },
killedBy: AdminJobsPage tests renders without crashing
statusReason: Unable to find an element with the text: Milk The Cows. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/AdminJobsPage.jsx:220:13
       form: <InstructorReportForm submitAction={submitInstructorReportJob} />,
     },
     {
-      name: "Instructor Report (for specific commons)",
+      name: "",
       form: (
         <InstructorReportSpecificCommonsForm
killedBy: AdminJobsPage tests user can submit instructor report (specific commons) job
statusReason: Unable to find an element with the text: Instructor Report (for specific commons). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
