[Killed] BlockStatement
main/components/Commons/AdminCommonsCard.jsx:28:33
     navigate(`/admin/editcommons/${commons.id}`);
   };
 
-  const handleDashboard = () => {
-    navigate(`/admin/dashboard/${commons.id}`);
-  };
+  const handleDashboard = () => {};
 
   const handleDelete = () => {
killedBy: AdminCommonsCard tests dashboard button navigates to dashboard page
statusReason: expected "spy" to be called with arguments: [ '/admin/dashboard/1' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:42:14
   };
 
   const handleLeaderboard = () => {
-    navigate(`/leaderboard/${commons.id}`);
+    navigate(``);
   };
 
killedBy: AdminCommonsCard tests leaderboard button navigates to leaderboard page
statusReason: expected "spy" to be called with arguments: [ '/leaderboard/1' ]

Received: 

  1st spy call:

  [
-   "/leaderboard/1",

[Killed] StringLiteral
main/components/Commons/AdminCommonsCard.jsx:69:24
         </Button>
         <Button
           variant="danger"
-          data-testid={`AdminCommonsCard-Modal-Delete-${commons.id}`}
+          data-testid={``}
           onClick={confirmDelete}
         >
killedBy: AdminCommonsCard tests modal delete button confirms deletion
statusReason: Unable to find an element by: [data-testid="AdminCommonsCard-Modal-Delete-1"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>
